via/viaems/contrib/CMSIS_Device_S32K344/Source/GCC/startup_S32K344.S
       .long    RESERVED_Handler                               /* 204 Reserved */
       .long    RESERVED_Handler                               /* 205 Reserved */
       .long    RESERVED_Handler                               /* 206 Reserved */
       .long    RESERVED_Handler                               /* 207 Reserved */
       .long    RESERVED_Handler                               /* 208 Reserved */
       .long    RESERVED_Handler                               /* 209 Reserved */
       .long    RESERVED_Handler                               /* 210 Reserved */
       .long    RESERVED_Handler                               /* 211 Reserved */
       .long    SoC_PLL_Handler                                /* 212 PLL LOL interrupt */
__Vectors_End:
       .equ     __Vectors_Size, __Vectors_End - __Vectors
       .size    __Vectors, . - __Vectors


       .thumb
       .section .text
       .align   2

       .thumb_func
       .type    Reset_Handler, %function
       .globl   Reset_Handler
       .fnstart
       .cantunwind
Reset_Handler:

       mov     r0,#0
       msr     control, r0

#ifndef START_FROM_RAM
       cpsid   i                       /* Mask interrupts */
       bl      DisableSWT0
       bl      InitECC
       cpsie   i                       /* Unmask interrupts */
#endif

       bl      SystemInit

       ldr     r4, =__copy_table_start__
       ldr     r5, =__copy_table_end__

.L_loop0:
       cmp     r4, r5
       bge     .L_loop0_done
       ldr     r1, [r4]                /* source address */
       ldr     r2, [r4, #4]            /* destination address */
       ldr     r3, [r4, #8]            /* word count */
       lsl     r3, r3, #2              /* byte count */

.L_loop0_0:
       subs    r3, #4                  /* decrement byte count */
       ittt    ge
       ldrge   r0, [r1, r3]
       strge   r0, [r2, r3]
       bge     .L_loop0_0

       adds    r4, #12
       b       .L_loop0
.L_loop0_done:

       ldr     r3, =__zero_table_start__
       ldr     r4, =__zero_table_end__

.L_loop2:
       cmp     r3, r4
       bge     .L_loop2_done
       ldr     r1, [r3]                /* destination address */
       ldr     r2, [r3, #4]            /* word count */
       lsl     r2, r2, #2              /* byte count */
       movs    r0, 0

.L_loop2_0:
       subs    r2, #4                  /* decrement byte count */
       itt     ge
       strge   r0, [r1, r2]
       bge     .L_loop2_0

       adds    r3, #8
       b       .L_loop2
.L_loop2_done:

       bl      _start

       .fnend
       .size    Reset_Handler, . - Reset_Handler


/* The default macro is not used for HardFault_Handler
 * because this results in a poor debug illusion.
 */
       .thumb_func
       .type   HardFault_Handler, %function
       .weak   HardFault_Handler
       .fnstart
       .cantunwind
HardFault_Handler:

       b       .

       .fnend
       .size   HardFault_Handler, . - HardFault_Handler


       .thumb_func
       .type   Default_Handler, %function
       .weak   Default_Handler
       .fnstart
       .cantunwind
Default_Handler:

       b       .

       .fnend
       .size   Default_Handler, . - Default_Handler


/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
       .macro  Set_Default_Handler  Handler_Name
       .weak   \Handler_Name
       .set    \Handler_Name, Default_Handler
       .endm


/* Default exception/interrupt handler */
       Set_Default_Handler  RESERVED_Handler

       Set_Default_Handler  NMI_Handler
       Set_Default_Handler  MemManage_Handler
       Set_Default_Handler  BusFault_Handler
       Set_Default_Handler  UsageFault_Handler
       Set_Default_Handler  SVC_Handler
       Set_Default_Handler  DebugMon_Handler
       Set_Default_Handler  PendSV_Handler
       Set_Default_Handler  SysTick_Handler

       Set_Default_Handler  INT0_Handler
       Set_Default_Handler  INT1_Handler
       Set_Default_Handler  INT2_Handler
       Set_Default_Handler  INT3_Handler
       Set_Default_Handler  DMATCD0_Handler
       Set_Default_Handler  DMATCD1_Handler
       Set_Default_Handler  DMATCD2_Handler
       Set_Default_Handler  DMATCD3_Handler
       Set_Default_Handler  DMATCD4_Handler
       Set_Default_Handler  DMATCD5_Handler
       Set_Default_Handler  DMATCD6_Handler
       Set_Default_Handler  DMATCD7_Handler
       Set_Default_Handler  DMATCD8_Handler
       Set_Default_Handler  DMATCD9_Handler
       Set_Default_Handler  DMATCD10_Handler
       Set_Default_Handler  DMATCD11_Handler
       Set_Default_Handler  DMATCD12_Handler
       Set_Default_Handler  DMATCD13_Handler
       Set_Default_Handler  DMATCD14_Handler
       Set_Default_Handler  DMATCD15_Handler
       Set_Default_Handler  DMATCD16_Handler
       Set_Default_Handler  DMATCD17_Handler
       Set_Default_Handler  DMATCD18_Handler
       Set_Default_Handler  DMATCD19_Handler
       Set_Default_Handler  DMATCD20_Handler
       Set_Default_Handler  DMATCD21_Handler
       Set_Default_Handler  DMATCD22_Handler
       Set_Default_Handler  DMATCD23_Handler
       Set_Default_Handler  DMATCD24_Handler
       Set_Default_Handler  DMATCD25_Handler
       Set_Default_Handler  DMATCD26_Handler
       Set_Default_Handler  DMATCD27_Handler
       Set_Default_Handler  DMATCD28_Handler
       Set_Default_Handler  DMATCD29_Handler
       Set_Default_Handler  DMATCD30_Handler
       Set_Default_Handler  DMATCD31_Handler
       Set_Default_Handler  ERM_0_Handler
       Set_Default_Handler  ERM_1_Handler
       Set_Default_Handler  MCM_Handler
       Set_Default_Handler  STM0_Handler
       Set_Default_Handler  STM1_Handler
       Set_Default_Handler  SWT0_Handler
       Set_Default_Handler  CTI0_Handler
       Set_Default_Handler  FLASH_0_Handler
       Set_Default_Handler  FLASH_1_Handler
       Set_Default_Handler  FLASH_2_Handler
       Set_Default_Handler  RGM_Handler
       Set_Default_Handler  PMC_Handler
       Set_Default_Handler  SIUL_0_Handler
       Set_Default_Handler  SIUL_1_Handler
       Set_Default_Handler  SIUL_2_Handler
       Set_Default_Handler  SIUL_3_Handler
       Set_Default_Handler  EMIOS0_0_Handler
       Set_Default_Handler  EMIOS0_1_Handler
       Set_Default_Handler  EMIOS0_2_Handler
       Set_Default_Handler  EMIOS0_3_Handler
       Set_Default_Handler  EMIOS0_4_Handler
       Set_Default_Handler  EMIOS0_5_Handler
       Set_Default_Handler  EMIOS1_0_Handler
       Set_Default_Handler  EMIOS1_1_Handler
       Set_Default_Handler  EMIOS1_2_Handler
       Set_Default_Handler  EMIOS1_3_Handler
       Set_Default_Handler  EMIOS1_4_Handler
       Set_Default_Handler  EMIOS1_5_Handler
       Set_Default_Handler  EMIOS2_0_Handler
       Set_Default_Handler  EMIOS2_1_Handler
       Set_Default_Handler  EMIOS2_2_Handler
       Set_Default_Handler  EMIOS2_3_Handler
       Set_Default_Handler  EMIOS2_4_Handler
       Set_Default_Handler  EMIOS2_5_Handler
       Set_Default_Handler  WKPU_Handler
       Set_Default_Handler  CMU0_Handler
       Set_Default_Handler  CMU1_Handler
       Set_Default_Handler  CMU2_Handler
       Set_Default_Handler  BCTU_Handler
       Set_Default_Handler  LCU0_Handler
       Set_Default_Handler  LCU1_Handler
       Set_Default_Handler  PIT0_Handler
       Set_Default_Handler  PIT1_Handler
       Set_Default_Handler  PIT2_Handler
       Set_Default_Handler  RTC_Handler
       Set_Default_Handler  EMAC_0_Handler
       Set_Default_Handler  EMAC_1_Handler
       Set_Default_Handler  EMAC_2_Handler
       Set_Default_Handler  EMAC_3_Handler
       Set_Default_Handler  FlexCAN0_0_Handler
       Set_Default_Handler  FlexCAN0_1_Handler
       Set_Default_Handler  FlexCAN0_2_Handler
       Set_Default_Handler  FlexCAN0_3_Handler
       Set_Default_Handler  FlexCAN1_0_Handler
       Set_Default_Handler  FlexCAN1_1_Handler
       Set_Default_Handler  FlexCAN1_2_Handler
       Set_Default_Handler  FlexCAN2_0_Handler
       Set_Default_Handler  FlexCAN2_1_Handler
       Set_Default_Handler  FlexCAN2_2_Handler
       Set_Default_Handler  FlexCAN3_0_Handler
       Set_Default_Handler  FlexCAN3_1_Handler
       Set_Default_Handler  FlexCAN4_0_Handler
       Set_Default_Handler  FlexCAN4_1_Handler
       Set_Default_Handler  FlexCAN5_0_Handler
       Set_Default_Handler  FlexCAN5_1_Handler
       Set_Default_Handler  FLEXIO_Handler
       Set_Default_Handler  LPUART0_Handler
       Set_Default_Handler  LPUART1_Handler
       Set_Default_Handler  LPUART2_Handler
       Set_Default_Handler  LPUART3_Handler
       Set_Default_Handler  LPUART4_Handler
       Set_Default_Handler  LPUART5_Handler
       Set_Default_Handler  LPUART6_Handler
       Set_Default_Handler  LPUART7_Handler
       Set_Default_Handler  LPUART8_Handler
       Set_Default_Handler  LPUART9_Handler
       Set_Default_Handler  LPUART10_Handler
       Set_Default_Handler  LPUART11_Handler
       Set_Default_Handler  LPUART12_Handler
       Set_Default_Handler  LPUART13_Handler
       Set_Default_Handler  LPUART14_Handler
       Set_Default_Handler  LPUART15_Handler
       Set_Default_Handler  LPI2C0_Handler
       Set_Default_Handler  LPI2C1_Handler
       Set_Default_Handler  LPSPI0_Handler
       Set_Default_Handler  LPSPI1_Handler
       Set_Default_Handler  LPSPI2_Handler
       Set_Default_Handler  LPSPI3_Handler
       Set_Default_Handler  LPSPI4_Handler
       Set_Default_Handler  LPSPI5_Handler
       Set_Default_Handler  QSPI_Handler
       Set_Default_Handler  SAI0_Handler
       Set_Default_Handler  SAI1_Handler
       Set_Default_Handler  JDC_Handler
       Set_Default_Handler  ADC0_Handler
       Set_Default_Handler  ADC1_Handler
       Set_Default_Handler  ADC2_Handler
       Set_Default_Handler  LPCMP0_Handler
       Set_Default_Handler  LPCMP1_Handler
       Set_Default_Handler  LPCMP2_Handler
       Set_Default_Handler  FCCU_0_Handler
       Set_Default_Handler  FCCU_1_Handler
       Set_Default_Handler  STCU_LBIST_MBIST_Handler
       Set_Default_Handler  HSE_MU0_TX_Handler
       Set_Default_Handler  HSE_MU0_RX_Handler
       Set_Default_Handler  HSE_MU0_ORED_Handler
       Set_Default_Handler  HSE_MU1_TX_Handler
       Set_Default_Handler  HSE_MU1_RX_Handler
       Set_Default_Handler  HSE_MU1_ORED_Handler
       Set_Default_Handler  SoC_PLL_Handler

       .end
